[
  {
    "slug": "transparent-search-brand-health-leading-indicators",
    "title": "Quantified Search-Based Leading Indicators of Brand Health Across 7 Markets",
    "role": "Director, Data & Analytics",
    "years": "Mar 2025 - Present",
    "company": "Transparent Partners",
    "location": "Chicago, IL",
    "companyLogo": "/images/logos/transparent-partners.svg",
    "tags": [
      "Marketing Analytics",
      "Time Series",
      "Regression Modeling",
      "Competitive Benchmarking",
      "Executive Storytelling"
    ],
    "setup": "Brand marketers needed a higher-frequency way to monitor meaningful brand movement during high-spend campaigns. Survey-based brand trackers updated slowly (and often had low sample sizes), limiting the ability to make in-market adjustments. Data availability also introduced constraints: only ~3 years of history, staggered time series due to lags, and markets with quarterly or missing survey waves. Seasonality and trends required transformations to produce interpretable relationships.",
    "workCompleted": "Prepared and transformed daily search datasets for the brand and nine key competitors across seven global markets. Tested leading/lagging relationships using correlation analysis with multiple lags in both directions. Built and tuned multiple regression models to identify the most valuable search signals while accounting for seasonality/trend effects. Visualized and documented findings through an executive slide deck and a detailed R Markdown data story, including code delivery to enable long-term integration into existing internal models.",
    "results": "Enabled a weekly review of meaningful brand-health movement (versus monthly or quarterly survey cycles) and introduced a practical leading indicator that marketers could use to adjust campaigns while in-market to improve spend efficiency. Established a predictive relationship among search, brand-health surveys, and commercial outcomes, allowing brand health to be used as an intermediate variable in marketing mix models—supporting more actionable understanding of drivers of both brand movement and sales.",
    "skillsExercised": [
      "Lag Analysis",
      "Time-Series Signal Engineering",
      "Model Tuning",
      "Cross-Market Analytics",
      "R Markdown Data Storytelling",
      "Executive-Level Communication"
    ]
  },
  {
    "slug": "transparent-customer-marketing-data-architecture-salesforce-data360",
    "title": "Designed Customer Marketing Data Architecture and Roadmap for a Salesforce Data 360 Evaluation",
    "role": "Director, Data & Analytics",
    "years": "Mar 2025 - Present",
    "company": "Transparent Partners",
    "location": "Chicago, IL",
    "companyLogo": "/images/logos/transparent-partners.svg",
    "tags": [
      "Data Architecture",
      "Marketing Technology",
      "Salesforce",
      "Change Management",
      "Marketing Strategy"
    ],
    "setup": "A $55B healthcare brand needed a coherent customer marketing data foundation to support evaluation of Salesforce Data 360 versus alternatives within its existing MarTech stack. Requirements, source systems, and measurement needs were fragmented across teams, creating ambiguity about what data was needed, how it should flow, and what work had to happen before implementation.",
    "workCompleted": "Led the architecture design process by conducting 18 stakeholder discovery sessions and translating needs into user stories, use cases, and functional/tactical requirements. Used those requirements to evaluate options including investment in a customer data platform versus improved integrations with the current technology stack. Assessed costs, benefits, and change-management considerations, then produced a recommended two-year roadmap covering foundational people/process/data work and implementation-focused technology activities.",
    "results": "Delivered a future-state architecture and implementation roadmap that clarified requirements, dependencies, and sequencing for the Salesforce Data 360 decision—accelerating cross-team alignment on the activities and investments needed, how data should flow, and what decisions had to be resolved prior to implementation.",
    "skillsExercised": [
      "Stakeholder Discovery & Synthesis",
      "Target-State Data Architecture Design",
      "MarTech Option Evaluation",
      "Roadmapping",
      "Business Case Development",
      "Change-Management Planning"
    ]
  },
  {
    "slug": "3m-marketing-analytics-function",
    "title": "Established Marketing Analytics Function for a New Global Marketing Center",
    "role": "Global Marketing Analytics Leader, Safety & Industrial Business Group",
    "years": "Jan 2021 - Jul 2023",
    "company": "3M Corporation",
    "location": "St. Paul, MN",
    "companyLogo": "/images/logos/3m.svg",
    "tags": [
      "Leadership",
      "Org Design",
      "Strategy",
      "Agile",
      "Marketing Operations",
      "Data Engineering"
    ],
    "setup": "3M formed a new Marketing Center during an organizational restructuring, but the Safety & Industrial Business Group did not yet have a centralized marketing analytics function or clear processes for prioritizing and delivering analytics work.",
    "workCompleted": "Defined team roles, responsibilities, and focus areas, including skills assessments and an organizational focus map. Implemented a Scrum-based workflow to manage requests and maintain a consistent cadence with global marketing operations leaders. Established cleaner foundational datasets and built value-added data flows that automated dashboard outputs into business-ready PowerPoint materials to support marketers with faster insights.",
    "results": "Scaled the team from 5 to 11 through deliberate role definition and hiring. Established repeatable ways of working that improved clarity on priorities and increased confidence in analytics delivery across the marketing organization, supporting the work of 1,000+ marketers with more timely BI and insight delivery.",
    "skillsExercised": [
      "Strategic Org Design",
      "Scrum Workflows",
      "Stakeholder Management",
      "Operating Model Design",
      "Work Intake & Prioritization"
    ]
  },
  {
    "slug": "3m-power-platform-performance-reporting",
    "title": "Delivered Power Platform Performance Reporting for a $13B Business Unit",
    "role": "Global Marketing Analytics Leader, Safety & Industrial Business Group",
    "years": "Jan 2021 - Jul 2023",
    "company": "3M Corporation",
    "location": "St. Paul, MN",
    "companyLogo": "/images/logos/3m.svg",
    "tags": [
      "Power BI",
      "Power Platform",
      "Analytics Product Delivery",
      "Requirements Translation",
      "Data Storytelling"
    ],
    "setup": "Marketing leadership needed consistent, scalable visibility into performance, but reporting was fragmented across teams and tools, limiting adoption and slowing decision-making.",
    "workCompleted": "Led the end-to-end delivery of marketing performance reporting products built on Microsoft Power Platform. Partnered with stakeholders to translate needs into scalable reporting designs, guided the team through development and rollout, and incorporated automation where appropriate to reduce manual effort and improve reliability.",
    "results": "Delivered performance reporting products that improved the accessibility and usability of marketing insights across the business group and reduced reliance on manual reporting steps.",
    "skillsExercised": [
      "Power BI",
      "Power Platform",
      "Analytics Product Management",
      "Automation Mindset",
      "Executive Reporting"
    ]
  },
  {
    "slug": "3m-analytics-strategy-demandgen-martech",
    "title": "Set Multi-Year Analytics Direction and Improved Demand-Generation Measurement",
    "role": "Global Marketing Analytics Leader, Safety & Industrial Business Group",
    "years": "Jan 2021 - Jul 2023",
    "company": "3M Corporation",
    "location": "St. Paul, MN",
    "companyLogo": "/images/logos/3m.svg",
    "tags": [
      "Strategic Planning",
      "Roadmapping",
      "Marketing Measurement",
      "MarTech",
      "Executive Communication"
    ],
    "setup": "As the analytics capability matured, leadership needed a clear multi-year plan to guide investments and a stronger measurement foundation across marketing platforms to support consistent demand-generation reporting.",
    "workCompleted": "Authored a three-year strategic plan and roadmap for team expansion, technology/data investments, and planned initiatives. Delivered segment reports and represented the business group in enterprise demand-generation reporting efforts. Supported marketing technology optimization across Salesforce.com, Adobe Analytics, and Tealium to improve consistency of measurement inputs.",
    "results": "Aligned stakeholders on a clear multi-year direction for the analytics function while improving the quality and consistency of demand-generation insights and reporting inputs across key marketing platforms.",
    "skillsExercised": [
      "Strategy & Roadmapping",
      "Enterprise Reporting Influence",
      "Marketing Measurement",
      "MarTech Enablement",
      "Executive Alignment"
    ]
  },
  {
    "slug": "3m-sap-reporting-recovery",
    "title": "Re-Established U.S. Reporting After SAP Go-Live for 1,200+ Stakeholders",
    "role": "Product Owner, Safety & Industrial Business Group Analytics",
    "years": "Jan 2019 - Dec 2020",
    "company": "3M Corporation",
    "location": "St. Paul, MN",
    "companyLogo": "/images/logos/3m.svg",
    "tags": [
      "Product Ownership",
      "SAP",
      "Stakeholder Management",
      "Requirements Definition",
      "Delivery Management"
    ],
    "setup": "A major SAP ERP implementation disrupted existing reporting and created urgent demand for re-established analytics. Stakeholders needed continuity and clarity while data sources, logic, and delivery mechanisms changed.",
    "workCompleted": "Owned the reporting rebuild effort by coordinating with stakeholders and technical teams to translate needs into executable requirements. Managed prioritization across diverse user groups and ensured delivery sequencing addressed the most business-critical reporting first.",
    "results": "Restored reporting coverage to 1,200+ stakeholders across the U.S. organization after the SAP transition and reduced disruption during the post-go-live period through clearer prioritization and delivery visibility.",
    "skillsExercised": [
      "ERP Transition Support",
      "Cross-Functional Product Ownership",
      "High-Stakes Stakeholder Management",
      "Backlog Prioritization"
    ]
  },
  {
    "slug": "3m-report-inventory-governance",
    "title": "Created a Report Inventory and Governance Baseline for 200+ Assets",
    "role": "Product Owner, Safety & Industrial Business Group Analytics",
    "years": "Jan 2019 - Dec 2020",
    "company": "3M Corporation",
    "location": "St. Paul, MN",
    "companyLogo": "/images/logos/3m.svg",
    "tags": [
      "Data Governance",
      "Documentation",
      "Process Design",
      "Analytics Operations",
      "Quality Control"
    ],
    "setup": "Reporting sprawl made it difficult to understand what existed, who used it, and which assets were redundant or risky—especially after system changes introduced new data definitions and dependencies.",
    "workCompleted": "Built a detailed report inventory to document the reporting landscape (200+ assets), including purpose and ownership considerations. Used the inventory as a foundation for consistent definitions, decision-making about what to keep or retire, and improved coordination across the analytics team.",
    "results": "Improved visibility into the reporting footprint and created a practical foundation for governance and standardization, enabling more disciplined maintenance decisions and reducing the risk of unmanaged, duplicative reporting.",
    "skillsExercised": [
      "Analytics Governance",
      "Operational Documentation",
      "Standardization Foundations",
      "Risk Reduction"
    ]
  },
  {
    "slug": "3m-reporting-standardization-agile",
    "title": "Standardized Reporting Delivery and Reduced Maintenance Through Consolidation",
    "role": "Product Owner, Safety & Industrial Business Group Analytics",
    "years": "Jan 2019 - Dec 2020",
    "company": "3M Corporation",
    "location": "St. Paul, MN",
    "companyLogo": "/images/logos/3m.svg",
    "tags": [
      "Agile/Scrum",
      "People Leadership",
      "Change Management",
      "Operational Efficiency",
      "Stakeholder Alignment"
    ],
    "setup": "After SAP go-live and a company reorganization, the analytics team needed a dependable way to prioritize work, deliver consistently, and simplify a reporting landscape that had become costly to maintain.",
    "workCompleted": "Implemented Agile methodology using Scrum workflow to manage intake, backlog prioritization, and sprint delivery. Co-developed the strategic plan for the Data Intelligence function within Customer Operations. Led consolidation and standardization by aligning stakeholders on common definitions and migrating users to streamlined outputs. Managed 5–12 direct reports across report design, software development, data science, and interns.",
    "results": "Reduced the reporting footprint by 65+ reports, improving maintainability and lowering database load. Increased transparency and predictability of delivery through a consistent Agile operating rhythm across the team.",
    "skillsExercised": [
      "Scrum Implementation",
      "Org & Team Leadership (5–12 directs)",
      "Report Rationalization",
      "Operational Excellence",
      "Change Adoption"
    ]
  },
  {
    "slug": "3m-sales-software-deployment",
    "title": "Deployed Data-Driven Sales Software to 400+ Users",
    "role": "Data Science Team Manager, Industrial Business Group",
    "years": "Jan 2016 - Dec 2018",
    "company": "3M Corporation",
    "location": "St. Paul, MN",
    "companyLogo": "/images/logos/3m.svg",
    "tags": [
      "Analytics Product Delivery",
      "R Shiny",
      "User Adoption",
      "Sales Enablement",
      "Team Management"
    ],
    "setup": "Sales teams needed practical tools that translated analytics into day-to-day actions. Without an adopted workflow, insights remained disconnected from frontline execution.",
    "workCompleted": "Led a team of nine (statisticians, software developers, data scientists, interns) and oversaw development and deployment of sales software built for field use. Focused on usability, scalability, and adoption by partnering with stakeholders and iterating based on feedback.",
    "results": "Achieved adoption across 400+ employees, enabling more consistent sales decision-making and improving efficiency across multiple selling activities.",
    "skillsExercised": [
      "Product Delivery at Scale",
      "R Shiny Applications",
      "Adoption & Enablement",
      "Sales Analytics Leadership",
      "People Management"
    ]
  },
  {
    "slug": "3m-customer-segmentation-400k",
    "title": "Segmented 400K Customers Using 3.5 Years of POS Data",
    "role": "Data Science Team Manager, Industrial Business Group",
    "years": "Jan 2016 - Dec 2018",
    "company": "3M Corporation",
    "location": "St. Paul, MN",
    "companyLogo": "/images/logos/3m.svg",
    "tags": [
      "Customer Segmentation",
      "Statistical Methods",
      "R",
      "Data Engineering",
      "Sales Strategy"
    ],
    "setup": "Sales teams lacked a consistent way to understand and prioritize accounts based on behavior. Marketing and sales needed practical segmentation that field reps could apply without heavy interpretation.",
    "workCompleted": "Led development of customer segmentation by preparing multi-year POS data, applying statistical methods to cluster and label behaviors, and translating segments into field-friendly classifications. Partnered with sales leaders to ensure the output mapped to real-world selling motions.",
    "results": "Delivered a segmentation and labeling approach covering 400,000+ customers that improved how reps classified accounts and supported more targeted outreach and planning.",
    "skillsExercised": [
      "Segmentation & Labeling",
      "Behavioral Analytics Translation",
      "Field-Ready Insight Design",
      "Advanced R Analytics"
    ]
  },
  {
    "slug": "3m-recommendation-lost-sales-engine",
    "title": "Co-Developed Recommendation and Lost-Sales Analytics to Support Growth and Retention",
    "role": "Data Science Team Manager, Industrial Business Group",
    "years": "Jan 2016 - Dec 2018",
    "company": "3M Corporation",
    "location": "St. Paul, MN",
    "companyLogo": "/images/logos/3m.svg",
    "tags": [
      "Recommendation Systems",
      "Customer Analytics",
      "Cross-Sell/Upsell",
      "Retention Analytics",
      "Team Leadership"
    ],
    "setup": "The organization needed scalable ways to identify cross-sell/upsell opportunities and to spot early signals of account erosion, so sales teams could intervene with relevant actions.",
    "workCompleted": "Partnered with cross-functional stakeholders to define the opportunity model and supported the buildout of recommendation and lost-sales analytics. Focused on outputs that were understandable to the field and could be embedded into existing sales workflows.",
    "results": "Delivered analytics that supported increased sales within current accounts and helped reduce churn among eroding customers by making opportunities and risks more visible.",
    "skillsExercised": [
      "Opportunity Modeling",
      "Retention Signal Thinking",
      "Insight-to-Action Design",
      "Cross-Functional Analytics Delivery"
    ]
  },
  {
    "slug": "darden-130m-transactions-segmentation",
    "title": "Analyzed 130M Transactions to Guide Targeted Marketing Campaigns",
    "role": "Finance Intern, Advanced Analytics",
    "years": "Jun 2015 - Aug 2015",
    "company": "Darden Restaurants",
    "location": "Orlando, FL",
    "companyLogo": "/images/logos/darden.svg",
    "tags": ["SQL", "R", "Tableau", "Customer Analytics", "Marketing Strategy"],
    "setup": "Marketing teams wanted to use large-scale transaction data to understand customer behavior and identify segments most likely to respond to specific outreach strategies.",
    "workCompleted": "Queried and transformed transaction data, built segmentation and profitability bins, and profiled segments with behavioral and demographic context. Synthesized insights into recommendations for two campaign approaches: lapsed-customer reactivation and daypart/sales-area diversification.",
    "results": "Produced a segmentation framework and campaign recommendations grounded in 130M transactions, strengthening targeting decisions and creating reusable analysis patterns for the team.",
    "skillsExercised": [
      "Large-Scale SQL Analysis",
      "Segmentation in R",
      "Dashboarding in Tableau",
      "Campaign Targeting Analytics"
    ]
  },
  {
    "slug": "disney-tableau-reporting-modernization",
    "title": "Modernized Revenue Management Reporting from Excel to Tableau",
    "role": "Forecasting Intern, Revenue Management & Analytics",
    "years": "Jun 2014 - Dec 2014",
    "company": "The Walt Disney Company (Walt Disney World Themeparks)",
    "location": "Lake Buena Vista, FL",
    "companyLogo": "/images/logos/disney.svg",
    "tags": [
      "Tableau",
      "SAS",
      "Process Automation",
      "Dashboard Design",
      "Forecasting Support"
    ],
    "setup": "Critical reporting and forecasting workflows relied on manual Excel processes that were time-consuming and limited leaders’ ability to explore data quickly and consistently.",
    "workCompleted": "Converted recurring Excel reporting into Tableau dashboards published on the department server. Built an interactive market report dashboard for directors using SAS and Tableau. Supported attendance planning work (Annual Operating Plan) and contributed to daily/weekly reporting to evaluate attendance versus forecasts.",
    "results": "Improved reporting efficiency and accessibility by shifting manual Excel reporting to self-service Tableau dashboards, giving leaders faster visibility into key market and attendance metrics.",
    "skillsExercised": [
      "Tableau Publishing & Adoption",
      "SAS-to-Visualization Workflow",
      "Reporting Automation",
      "Forecasting Operations"
    ]
  },
  {
    "slug": "mba-analytics-specialization",
    "title": "Completed MBA with Analytics Specialization and Quantitative Distinction",
    "role": "Graduate Student",
    "years": "Aug 2013 - Dec 2015",
    "company": "University of Iowa Tippie School of Business",
    "location": "Iowa City, IA",
    "companyLogo": "/images/logos/iowa.svg",
    "tags": [
      "Statistics",
      "Marketing Analytics",
      "Business Strategy",
      "Academic Research Support",
      "Communication"
    ],
    "setup": "Pursued graduate education to deepen quantitative rigor and pair it with business fundamentals, creating a platform for leading analytics teams and translating insights into decisions.",
    "workCompleted": "Completed MBA coursework with an analytics focus and served as a Graduate Assistant supporting faculty and program needs, strengthening both analytical discipline and communication under time constraints.",
    "results": "Graduated with a 3.81 GPA and a 760 GMAT score (99th percentile), reinforcing quantitative strength and business breadth that supported subsequent leadership roles in analytics and data science.",
    "skillsExercised": [
      "Advanced Analytical Rigor",
      "Business Fundamentals",
      "Structured Problem Solving",
      "Executive-Ready Communication"
    ]
  }
]
